/*******************************************************************************
 * @file     tim.c
 * @brief    tim驱动代码
 * @history
 * Date       Version Author    description
 * ========== ======= ========= ================================================
 * 2025-05-05 V0.0    Xiaoyibar Create
 *
 * @Copyright Xiaoyibar all right reserved
 *******************************************************************************/
// [include]————————————————————————————————————————————————————————————————————
#include "tim.h"

void (*tim_hadndle[2])(void);
void (*tim_capture_handle)(uint32_t value);
/**
 * [tim1_init tim1初始化]
 * [定时周期/频率=TIMCLK/(PSC+1)(ARR+1)]
 * @param  arr [重装载值]
 * @param  psc [预分频数]
 * @return     []
 */
void tim1_init(uint16_t psc,uint16_t arr)
{
    /*1. 使能时钟——————————————————————————————————————————————————————————————*/
    RCC->APB2ENR |= 1 << 11;    // 使能时钟
    /*2. 配置定时器————————————————————————————————————————————————————————————*/
    TIM1->PSC = psc;            // 设置预分频数
    TIM1->ARR = arr;            // 设置自动重装载寄存器的值
    TIM1->CR1 &= ~(1 << 4);     // 向上计数
    TIM1->DIER = 1 << 0;        // 使能溢出更新中断
    /*3. 使能定时器————————————————————————————————————————————————————————————*/
    TIM1->CR1 = 1 << 0;         // 使能计数器
    /*4. 使能TIM1中断——————————————————————————————————————————————————————————*/
    NVIC->ISER[0] |= 1 << (TIM1_UP_IRQn & 0x1f);
}

/**
 * [tim2_init tim2初始化]
 * [定时周期/频率=TIMCLK/(PSC+1)(ARR+1)]
 * @param  arr [重装载值]
 * @param  psc [预分频数]
 * @return     []
 */
void tim2_init(uint16_t psc,uint16_t arr)
{
    /*1. 使能时钟——————————————————————————————————————————————————————————————*/
    RCC->APB1ENR |= 1 << 0;    // 使能时钟
    /*2. 配置定时器————————————————————————————————————————————————————————————*/
    TIM2->PSC = psc;           // 设置预分频数
    TIM2->ARR = arr;           // 设置自动重装载寄存器的值
    TIM2->CR1 &= ~(1 << 4);    // 向上计数
    TIM2->DIER = 1 << 0;       // 使能溢出更新中断
    /*3. 使能定时器————————————————————————————————————————————————————————————*/
    TIM2->CR1 = 1 << 0;        // 使能计数器
    /*4. 使能TIM2中断——————————————————————————————————————————————————————————*/
    NVIC->ISER[0] |= 1 << (TIM2_IRQn & 0x1f);
}

/**
 * [tim1_pwm_ch1_init tim1_pwm初始化]
 * [PWM频率=TIMCLK/(PSC+1)(ARR+1) 占空比=CCRx/ARR]
 * @param  arr [重装载值]
 * @param  psc [预分频数]
 * @return     []
 */
void tim1_pwm_ch1_init(uint16_t psc,uint16_t arr)
{
    /*1. 使能时钟——————————————————————————————————————————————————————————————*/
    RCC->APB2ENR |= 1 << 11;        // 使能TIM1时钟
    RCC->APB2ENR|= 1 << 2;          // 开启时钟 GPIOA/B时钟
    RCC->APB2ENR|= 1 << 0;          // 开启复用时钟
    /*2. 配置引脚——————————————————————————————————————————————————————————————*/
    GPIOA->CRH &= 0xFFFFFFF0;        // 复位PA8
    GPIOA->CRH |= 0X0000000B;        // 设置PA8为复用推挽输出50M
    /*3. 配置定时器————————————————————————————————————————————————————————————*/
    TIM1->PSC = psc;                 // 设置预分频数
    TIM1->ARR = arr;                 // 设置自动重装载寄存器的值
    TIM1->CR1 &= ~(1 << 4);          // 设置计数器模式 向上计数
    TIM1->CCMR1 &= ~( 3 << 0 );      // 设置通道1为    输出模式
    TIM1->CCMR1 |= 6 << 4;           // 设置通道PWM模式 PWM模式二
    TIM1->CCMR1 |= 1 << 3;           // 使能通道1 预装载
    TIM1->CCER |= 1 << 0;            // PWM信号输出使能
    TIM1->CCER &= ~( 1 << 1 );       // 设置PWM输出极性为高
    TIM1->CR1 |= 1 << 7 ;            // 使能TIM1自动预装载
    /*3. 使能定时器————————————————————————————————————————————————————————————*/
    TIM1->CR1 = 1 << 0;             // 使能计数器
    TIM1->BDTR = 1 << 15;           // 主输出使能
}

/**
 * [tim2_pwm_ch1_init tim2_pwm初始化]
 * [PWM频率=TIMCLK/(PSC+1)(ARR+1) 占空比CCRx/CNT]
 * @param  arr [重装载值]
 * @param  psc [预分频数]
 * @return     []
 */
void tim2_pwm_ch1_init(uint16_t psc,uint16_t arr)
{
    /*1. 使能时钟——————————————————————————————————————————————————————————————*/
    RCC->APB1ENR |= 1 << 0;         // 使能TIM2时钟
    RCC->APB2ENR|= 1 << 2;          // 开启时钟 GPIOA时钟
    RCC->APB2ENR|= 1 << 0;          // 开启复用时钟
    /*2. 配置引脚——————————————————————————————————————————————————————————————*/
    GPIOA->CRL &= 0xFFFFFFF0;        // 复位PA0
    GPIOA->CRL |= 0X0000000B;        // 设置PA0为复用推挽输出50M
    /*3. 配置定时器————————————————————————————————————————————————————————————*/
    TIM2->PSC = psc;                 // 设置预分频数
    TIM2->ARR = arr;                 // 设置自动重装载寄存器的值
    TIM2->CR1 &= ~(1 << 4);          // 设置计数器模式 向上计数
    TIM2->CCMR1 &= ~( 3 << 0 );      // 设置通道1为    输出模式
    TIM2->CCMR1 |= 7 << 4;           // 设置通道PWM模式 PWM模式二
    TIM2->CCMR1 |= 1 << 3;           // 使能通道1 预装载
    TIM2->CCER |= 1 << 0;            // PWM信号输出使能
    TIM2->CCER &= ~( 1 << 1 );       // 设置PWM输出极性为高
    TIM2->CR1 |= 1 << 7 ;            // 使能TIM2自动预装载寄存器
    /*3. 使能定时器————————————————————————————————————————————————————————————*/
    TIM2->CR1 = 1 << 0;              // 使能计数器
}

/**
 * [tim1_oc_ch1_init 输出比较模式初始化]
 * @param  arr [重装载值]
 * @param  psc [预分频数]
 * @return     []
 */
void tim1_oc_ch1_init(uint16_t psc,uint16_t arr)
{
    /*1. 使能时钟——————————————————————————————————————————————————————————————*/
    RCC->APB2ENR |= 1 << 11;         // 使能TIM1时钟
    RCC->APB2ENR|= 1 << 2;           // 开启时钟 GPIOA/B时钟
    RCC->APB2ENR|= 1 << 0;           // 开启复用时钟
    /*2. 配置引脚——————————————————————————————————————————————————————————————*/
    GPIOA->CRH &= 0xFFFFFFF0;        // 复位PA8
    GPIOA->CRH |= 0X0000000B;        // 设置PA8为复用推挽输出50M
    /*3. 配置定时器————————————————————————————————————————————————————————————*/
    TIM1->PSC = psc;                 // 设置预分频数
    TIM1->ARR = arr;                 // 设置自动重装载寄存器的值
    TIM1->CR1 &= ~(1 << 4);          // 设置计数器模式 向上计数
    TIM1->CCMR1 &= ~( 3 << 0 );      // 设置通道1 输出模式
    TIM1->CCMR1 |= 3 << 4;           // 设置通道1 输出比较翻转模式
    TIM1->CCER |= 1 << 0;            // PWM信号输出使能
    TIM1->CCER &= ~( 1 << 1 );       // 设置PWM输出极性为高
    TIM1->CR2 &= ~( 1 << 8 );        // 设置通道1输出空闲电平为低
    TIM1->DIER |= 1 << 1;            // 设置定时器比较中断使能
    /*3. 使能定时器————————————————————————————————————————————————————————————*/
    TIM1->CR1 = 1 << 0;              // 使能计数器
    TIM1->BDTR = 1 << 15;            // 主输出使能
    /*4. 使能TIM1中断——————————————————————————————————————————————————————————*/
    NVIC->ISER[0] |= 1 << TIM1_CC_IRQn;
}

/**
 * [tim2_ic_ch1_init 输入捕获模式初始化]
 * @param  arr [重装载值]
 * @param  psc [预分频数]
 * @return     []
 */
void tim2_ic_ch1_init(uint16_t psc,uint16_t arr)
{
    /*1. 使能时钟——————————————————————————————————————————————————————————————*/
    RCC->APB1ENR |= 1 << 0;         // 使能TIM2时钟
    RCC->APB2ENR|= 1 << 2;          // 开启时钟 GPIOA时钟
    RCC->APB2ENR|= 1 << 0;          // 开启复用时钟
    /*2. 配置引脚——————————————————————————————————————————————————————————————*/
    GPIOA->CRL &= 0xFFFFFFF0;        // 复位PA0
    GPIOA->CRL |= 0X00000004;        // 设置PA0为输入
    /*3. 配置定时器————————————————————————————————————————————————————————————*/
    TIM2->PSC = psc;                 // 设置预分频数
    TIM2->ARR = arr;                 // 设置自动重装载寄存器的值
    TIM2->CR1 &= ~(1 << 4);          // 设置计数器模式 向上计数
    TIM2->CCMR1 |= 1 << 0;           // 设置通道1为    输入模式
    TIM2->CCMR1 &= ~( 15 << 4 );     // 设置输入过滤   无
    TIM2->CCMR1 &= ~( 3 << 2 );      // 设置输入分频   不分频率
    TIM2->CCER &= ~( 1 << 1 );       // 设置捕获边沿   上升沿捕获
    TIM2->CCER |= 1 << 0;            // 使能捕获计数器的值到捕获寄存器中
    /*3. 使能定时器————————————————————————————————————————————————————————————*/
    TIM2->DIER |= 1 << 1;            // 使能定时器捕获中断
    TIM2->CR1 |= 1 << 0;             // 使能计数器
    /*4. 使能TIM2中断——————————————————————————————————————————————————————————*/
    NVIC->ISER[0] |= 1 << TIM2_IRQn;
}
/**
 * @brief set_pwm_ch1_duty_cycle 设置定时器通道1占空比
 */
void set_pwm_ch1_duty_cycle(TIM_TypeDef *tim,uint16_t value)
{
    tim->CCR1=value;
}

/**
 * @brief Set the tim timing handle 绑定中断处理函数
 * @param [in] tim 定时器索引
 * @param [in] cb  回调函数
 */
void set_tim_timing_handle(uint8_t tim,void (*cb)(void))
{
    tim_hadndle[tim]=cb;
}

void set_tim_capture_handle(void (*cb)(uint32_t value))
{
    tim_capture_handle=cb;
}

void TIM1_UP_IRQHandler(void)
{
    if(TIM1->SR&1<<0)   //溢出中断
    {
        tim_hadndle[0]();
    }
    TIM1->SR&=~(1<<0);  //清除中断标志位
}

uint8_t flag=0;
uint16_t period_1=0;

void TIM2_IRQHandler(void)
{
#if 0
    if(TIM2->SR&1<<0)   //溢出中断
    {
        tim_hadndle[1]();
    }
    TIM2->SR&=~(1<<0);  //清除中断标志位
#endif
    /* 捕获中断 */
    if(TIM2->SR&1<<1){ 
        /* 第一次 */
        if(!flag)
        {
            period_1 = TIM2->CCR1;
            flag=1; 
        }
        /* 第二次 */
        else 
        {         
            uint16_t period_2 = TIM2->CCR1;
            uint16_t period = (period_2 > period_1) ? \
                              (period_2 - period_1) : \
                              (0xFFFF - period_1 + period_2 + 1);
            tim_capture_handle(period);
            flag = 0;
        }
        TIM2->SR &=~(1<<1);
    }
}



#if 0
/**
 * [tim7_init tim7初始化]
 * @param  arr [重装载值]
 * @param  psc [预分频数]
 * @return     []
 */
void tim7_init(uint16_t psc,uint16_t arr)
{
    /*1. 使能时钟——————————————————————————————————————————————————————————————*/
    RCC->APB1ENR |= 1 << 5;    // 使能时钟
    /*2. 配置定时器————————————————————————————————————————————————————————————*/
    TIM7->PSC = psc;           // 设置预分频数
    TIM7->ARR = arr;           // 设置自动重装载寄存器的值
    TIM7->CR1 &= ~(1 << 4);    // 向上计数
    TIM7->DIER = 1 << 0;       // 使能溢出更新中断
    /*3. 使能定时器————————————————————————————————————————————————————————————*/
    TIM7->CR1 = 1 << 0;        // 使能计数器
    /*4. 使能TIM7中断——————————————————————————————————————————————————————————*/
    NVIC->ISER[1] |= 1 << (TIM7_IRQn & 0x1f);
}
#endif
#if 0
void TIM7_IRQHandler(void)
{
    if(TIM7->SR&1<<0)   //溢出中断
    {
        tim_hadndle[2]();
    }
    TIM7->SR&=~(1<<0);  //清除中断标志位
}
#endif
